{
  "projects": [
    {
      "title": "Viewdeo",
      "sub": "2018",
      "icon": "android_logo_icon.png",
      "description": "My first personal commercial Android application. Released end of November 2018.\n\nMade a Free version and a Paid version, nearly making 2+ sales a day, without any marketing.\n\nThe Application helps a niche, where there is problems with Reddit's Video Media files, that do not download and share properly on Mobile.\n\nThe App can also download other media types like Gifs, Streamables, Gyfcat, Giphy just to name a few, where ever user desires.\n\nThe media can then easily be shared and VIEWed later as videos.",
      "image": "viewdeo.png",
      "link": "https://play.google.com/store/apps/details?id=com.tegnatiek.veddit"
    },
    {
      "title": "Standard Bank App",
      "sub": "2013",
      "icon": "android_logo_icon.png",
      "description": "Working with teams within an Agile approach, we designed and engineered this application from the ground up.\n\nUsing best SOLID practices, we modularised the features, which also became the teams.\n\nFeatures were containerised and improved continuous delivery of the application, where no team had to depend on another.\n\nWe worked on a phone app at first and then enhanced it as a universal app later, which could span to Tablet devices.",
      "image": "sbg.png",
      "link": "https://play.google.com/store/apps/details?id=com.sbg.mobile.phone"
    },
    {
      "title": "Fed Health Medical Aid",
      "sub": "2012",
      "icon": "android_logo_icon.png",
      "description": "Here I experimented and got to use lots of snappy custom made animations within the application\n\nI created a 3D effect of turning over the virtual medical aid card, so that a customer could view the details on the back.\nI also made an interesting custom spinning animation with the menu icons.",
      "image": "fedhealth.png",
      "link": "https://aon.co.za/assets/docs/healthcare/2015/medical-scheme-documents/fedhealth/communication/zoom_-_fedhealth_apps.pdf"
    },
    {
      "title": "MarkitShare",
      "sub": "2012",
      "icon": "android_logo_icon.png",
      "description": "My first Tablet only application developed and my first ime using Google Maps API within the Android SDK.\n\nEven wpn best app of the year awards in South Africa\n(Click image to view article)\n\nThe application was aimed at real-estate agents selling properties and needed information on hand to show potential buyers.\n\nThe idea was to have information available about schools, safety, value, etc of immediate areas on a map.\n\n",
      "image": "markitshare.png",
      "link": "https://www.itnewsafrica.com/2013/08/mtn-crowns-the-best-south-african-apps/"
    },
    {
      "title": "VCPay",
      "sub": "2011",
      "icon": "android_logo_icon.png",
      "description": "My first commercial enterprise level application on the Android Platform.\n\nDeveloped side-by-side with my colleague who worked on the iOS version at the same time, sharing design ideas and UI/UX approaches.\n\nExperimented with some cool animations and custom views that didn't exist in Android at the time.\n\nThe App is still widely used today, and the company's name has changed since.",
      "image": "vcpay.png",
      "link": "https://play.google.com/store/apps/details?id=za.co.vcpay"
    },
    {
      "title": "Timester",
      "sub": "2009",
      "icon": "android_logo_icon.png",
      "description": "My very first Android Application and a personal project, while I was still a J2ME/Blackberry developer. The idea and art was from a friend.\n\n The idea was about a little hamster that runs on a wheel which \"powers\" the clock.\n\nThe hamster would also have cycles during the day, where it would take a lunch break, sleep, struggle to wake up, etc.\n\nI'm now planning to make an Android WearOs version and an updated LWP version soon.",
      "image": "timester.jpg",
      "link": "https://play.google.com/store/apps/details?id=za.co.bash.lwp"
    },
    {
      "title": "Polo GT, Date Drive",
      "sub": "2011",
      "icon": "android_logo_icon.png",
      "description": "Created an app that was used to gather data for a marketing campaign called Date Drive.\n\nIt was for the then new Polo GT from Volkswagen.\n\nThe App connected to a bluetooth heart-rate monitor, which was a bit of hacking as the device was meant to connect to another device, it would then broadcast the data to a crew over a 3G network.\n\nThe heart-rate was measured of couples going on a date in a Polo GT.",
      "image": "https://image.iol.co.za/image/1/process/1600x160000?source=https://inm-baobab-prod-eu-west-1.s3.amazonaws.com/public/inm/media/image/2018/09/10/73276626133155_Bunny.jpg",
      "link": "https://www.gq.co.za/style/i-think-i-love-my-wife-16531937"
    },
    {
      "title": "Club 21",
      "sub": "2006",
      "icon": "j2me_logo_icon.png",
      "description": "My first Mobile Application Game with socket server connection.\n\nGreat Dealing animations and a first Black Jack Game in South Africa.\n\nThe game was very popular on Mobile App Booklets (Before App stores).",
      "image": "club21.png",
      "link": ""
    },
    {
      "title": "Pirate's Pearls",
      "sub": "2006",
      "icon": "j2me_logo_icon.png",
      "description": "My first Mobile Action Game, the game was a popular match 3 game from that time.",
      "image": "piratePearls.png",
      "link": ""
    },
    {
      "title": "Pharaoh's Fortune",
      "sub": "2007",
      "icon": "j2me_logo_icon.png",
      "description": "Marketing Game for a new Casino, a Slot Machine where players could win actual prizes (Not Money).\n\nWinners was determined Server-Side, but via Random Draw.\n\nI used a blur effect from Photoshop to FAKE the perceived speed when the wheels spun.\n\nThis was in 2007 and I have never seen anyone else do this effect in this manner, which I was quite proud of.",
      "image": "pharaohsFortune.png",
      "link": ""
    },
    {
      "title": "Pyramids of Treasure",
      "sub": "2007",
      "icon": "j2me_logo_icon.png",
      "description": "Another slot machine game, based on the same engine I used before.\n\nIt was for another company and had more elaborate win combinations, also a Server-Side draw-to-win.",
      "image": "pyramidsOfTreasure.png",
      "link": ""
    },
    {
      "title": "Taxi Jam",
      "sub": "2007",
      "icon": "j2me_logo_icon.png",
      "description": "Rush Hour game clone, but with a South African twist.\n\nThe vehicles even took damage when trying to pass an impassible car (block).",
      "image": "taxiJam.png",
      "link": ""
    },
    {
      "title": "Tetra Lift",
      "sub": "2008",
      "icon": "j2me_logo_icon.png",
      "description": "A marketing campaign from Puma's shoes.\n\nThe idea was that the shoes were so light, they float.\n\nWe made a Tetris clone, where the blocks would float upwards, instead of dropping downwards.\n\nThe shoes were in the Tetris Blocks, which \"made\" them float.",
      "image": "tetraLift.png",
      "link": ""
    },
    {
      "title": "Fedhealth Medical",
      "sub": "2010",
      "icon": "android_logo_icon.png",
      "description": "Here I made hand rolled animations for navigation and menus, making it quite a flashy Android Application for the time.\n\nIt was a dual purpose App for both Brokers and Clients.",
      "image": "",
      "link": ""
    },
    {
      "title": "//TODO",
      "sub": "2019",
      "icon": "",
      "description": "Still adding projects (Android, Blackberry, Web, Spring, etc).\n\n//TODO: Adding better description for above projects.\n//TODO: The display images of these cards need to look better :) ",
      "image": "",
      "link": ""
    }
  ]
}
